      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMEN-NIVELACION.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OPTIONAL PROVINCIAS-ARCHIVO
           ASSIGN TO "C:\Users\Rocio\Desktop\Cobol\provincias.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OPTIONAL ESCUELAS-ARCHIVO
           ASSIGN TO "C:\Users\Rocio\Desktop\Cobol\escuelas.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  PROVINCIAS-ARCHIVO.
           01 PROVINCIAS-REGISTRO.
               05 PROVINCIAS-CODIGO PIC X.
               05 PROVINCIAS-NOMBRE PIC X(20).
       FD  ESCUELAS-ARCHIVO.
           01 ESCUELAS-REGISTRO.
               05 ESCUELAS-CODIGO-PROVINCIA PIC X.
               05 ESCUELAS-DISTRITO PIC 9(2).
               05 ESCUELAS-CODIGO PIC 99.
               05 ESCUELAS-VARONES PIC 999.
               05 ESCUELAS-MUJERES PIC 999.
               05 ESCUELAS-COMEDOR PIC 999.
       WORKING-STORAGE SECTION.
       01  PRESENTACION.
           05 TEXTO-PROVINCIA PIC X(11) VALUE "Provincia: ".
           05 NOMBRE-PROVINCIA PIC X(20).
           05 TEXTO-DISTRITO PIC X(10) VALUE "Distrito: ".
           05 DISTRITO PIC 9(2).
           05 TEXTO-ESCUELA PIC X(9) VALUE "Escuela: ".
           05 ESCUELA PIC 99.
           05 TEXTO-ALUMNOS PIC X(9) VALUE "Alumnos: ".
           05 ALUMNOS PIC 9999.
           05 TEXTO-COMEDOR PIC X(12) VALUE "Comedor(%): ".
           05 COMEDOR PIC ZZZ.ZZ.
       01  FIN-ARCHIVO-ESCUELAS PIC 9.
       01  FIN-ARCHIVO-PROVINCIAS PIC 9.
       01  TEMP PIC 99999.
       01  TOTAL-ESCUELAS-PROV PIC 999.
       01  TOTAL-ALUMNOS-PROV PIC 9(8).
       01  GUARDAR-ENTER PIC X.
       01  TOTAL-ESCUELAS PIC 99999.
       01  TOTAL-ALUMNOS PIC 9(20).
       01  MAX-ALUMNOS PIC 9999.
       01  TEMP2 PIC 99999999.
       PROCEDURE DIVISION.
       EMPEZAR-PROGRAMA.
           PERFORM APERTURA-ARCHIVO.
           MOVE 0 TO MAX-ALUMNOS.
           MOVE 0 TO TOTAL-ESCUELAS-PROV.
           MOVE 0 TO TOTAL-ALUMNOS-PROV.
           MOVE 0 TO TOTAL-ESCUELAS.
           MOVE 0 TO TOTAL-ALUMNOS.
           MOVE 1 TO FIN-ARCHIVO-PROVINCIAS.
           MOVE 1 TO FIN-ARCHIVO-ESCUELAS.
           PERFORM LEER-SIGUIENTE-REGISTRO-PROV.
           PERFORM LEER-SIGUIENTE-REGISTRO-ESC.
           DISPLAY PROVINCIAS-NOMBRE ":".
           DISPLAY "-------------------".
           PERFORM MOSTRAR-PRESENTACION
           UNTIL FIN-ARCHIVO-PROVINCIAS = 0 OR FIN-ARCHIVO-ESCUELAS=0.
           PERFORM SIGUIENTE-PAGINA.
           PERFORM MOSTRAR-TOTALES.
           PERFORM CIERRE-ARCHIVO.
           MOVE 1 TO FIN-ARCHIVO-ESCUELAS FIN-ARCHIVO-PROVINCIAS.
           PERFORM APERTURA-ARCHIVO.
           DISPLAY "Escuela/s con más alumnado del pais:"
           DISPLAY " "
           PERFORM LEER-SIGUIENTE-REGISTRO-PROV.
           PERFORM LEER-SIGUIENTE-REGISTRO-ESC.
           PERFORM MOSTRAR-MAXIMOS-ALUMNOS
           UNTIL FIN-ARCHIVO-ESCUELAS = 0 OR FIN-ARCHIVO-PROVINCIAS = 0.
           PERFORM CIERRE-ARCHIVO.

       TERMINAR-PROGRAMA.
           STOP RUN.

       APERTURA-ARCHIVO.
           OPEN INPUT PROVINCIAS-ARCHIVO.
           OPEN INPUT ESCUELAS-ARCHIVO.

       CIERRE-ARCHIVO.
           CLOSE PROVINCIAS-ARCHIVO.
           CLOSE ESCUELAS-ARCHIVO.

       LEER-SIGUIENTE-REGISTRO-PROV.
           READ PROVINCIAS-ARCHIVO NEXT RECORD
           AT END
           MOVE 0 TO FIN-ARCHIVO-PROVINCIAS.

       MOSTRAR-PRESENTACION.
           PERFORM MOSTRAR-CAMPOS.
           ADD ALUMNOS TO TOTAL-ALUMNOS-PROV.
           PERFORM LEER-SIGUIENTE-REGISTRO.

       LEER-SIGUIENTE-REGISTRO-ESC.
           READ ESCUELAS-ARCHIVO NEXT RECORD
           AT END
           MOVE 0 TO FIN-ARCHIVO-ESCUELAS.

       LEER-SIGUIENTE-REGISTRO.
           PERFORM LEER-SIGUIENTE-REGISTRO-ESC.
           ADD 1 TO TOTAL-ESCUELAS-PROV.
           ADD 1 TO TOTAL-ESCUELAS.
           ADD ALUMNOS TO TOTAL-ALUMNOS.
           IF ALUMNOS > MAX-ALUMNOS
               MOVE ALUMNOS TO MAX-ALUMNOS.
           IF ESCUELAS-CODIGO-PROVINCIA NOT = PROVINCIAS-CODIGO
               DISPLAY " "
               DISPLAY "TOTAL DE ESCUELAS: " TOTAL-ESCUELAS-PROV
               DISPLAY "TOTAL ALUMNOS: " TOTAL-ALUMNOS-PROV
               PERFORM LEER-SIGUIENTE-REGISTRO-PROV
               UNTIL ESCUELAS-CODIGO-PROVINCIA = PROVINCIAS-CODIGO
               OR FIN-ARCHIVO-PROVINCIAS = 0
               IF FIN-ARCHIVO-PROVINCIAS NOT = 0
                   MOVE 0 TO TOTAL-ESCUELAS-PROV
                   MOVE 0 TO TOTAL-ALUMNOS-PROV
                   DISPLAY " "
                   DISPLAY PROVINCIAS-NOMBRE ":"
                   DISPLAY "-----------------"
               END-IF
           END-IF.


       MOSTRAR-CAMPOS.
           MOVE PROVINCIAS-NOMBRE TO NOMBRE-PROVINCIA.
           MOVE ESCUELAS-DISTRITO TO DISTRITO.
           MOVE ESCUELAS-CODIGO TO ESCUELA.
           ADD ESCUELAS-VARONES TO ESCUELAS-MUJERES GIVING ALUMNOS.
           MULTIPLY 100 BY ESCUELAS-COMEDOR GIVING TEMP.
           DIVIDE TEMP BY ALUMNOS GIVING COMEDOR.
           DISPLAY TEXTO-DISTRITO DISTRITO "   " TEXTO-ESCUELA ESCUELA
           "   " TEXTO-ALUMNOS ALUMNOS "   " TEXTO-COMEDOR COMEDOR.

       SIGUIENTE-PAGINA.
           DISPLAY " "
           DISPLAY "Presione la tecla ENTER para ver la"
           " siguiente pagina...".
           ACCEPT GUARDAR-ENTER.

       MOSTRAR-TOTALES.
           DISPLAY "TOTAL DE ESCUELAS EN EL PAIS: " TOTAL-ESCUELAS.
           DISPLAY "TOTAL DE ALUMNOS EN EL PAIS: " TOTAL-ALUMNOS.

       MOSTRAR-MAXIMOS-ALUMNOS.
           ADD ESCUELAS-VARONES TO ESCUELAS-MUJERES GIVING TEMP2.
           IF TEMP2 = MAX-ALUMNOS
               DISPLAY "Provincia: " PROVINCIAS-NOMBRE "   Distrito: "
               ESCUELAS-DISTRITO "   Escuela: " ESCUELAS-CODIGO
           END-IF.
           PERFORM LEER-SIGUIENTE-REGISTRO-ESC.
           IF ESCUELAS-CODIGO-PROVINCIA NOT = PROVINCIAS-CODIGO
               PERFORM LEER-SIGUIENTE-REGISTRO-PROV
               UNTIL ESCUELAS-CODIGO-PROVINCIA = PROVINCIAS-CODIGO
               OR FIN-ARCHIVO-PROVINCIAS = 0
           END-IF.

       END PROGRAM EXAMEN-NIVELACION.
